---
type: StructuralSectionRectangularBar
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionRectangularBar

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangularBar` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionRectangularBar | 2015 | `public StructuralSectionRectangularBar ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , dou` |